
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	 СтрокаТабличнойЧасти.ЦенаРеализации = ЦенаИзНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	 СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	  
КонецПроцедуры

&НаСервере
Функция ЦенаИзНоменклатурыНаСервере(Номенклатура)
	
	Возврат Номенклатура.ЦенаЗакупки;

КонецФункции

&НаКлиенте
Процедура ТоварыКоличетствоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	//Массив = РасчетыКлиент.РасчитатьСтоймость(Элементы.Товары.ТекущиеДанные.ЦенаРеализации, Элементы.Товары.ТекущиеДанные.Количество);
	//Элементы.Товары.ТекущиеДанные.Сумма              = Массив [0];
	//Элементы.Товары.ТекущиеДанные.Скидка             = Массив [1];
	//Элементы.Товары.ТекущиеДанные.СтоймостьСоСкидкой = Массив [2];
	
КонецПроцедуры
