&НаКлиенте
Функция РасчитатьСтоймость (Цена, Количество) Экспорт
	
	//Стоймость = Цена * Количество;
	//
	//Если Стоймость >= 1000 И Стоймость < 5000 Тогда
	//	Скидка = 0.01 * Стоймость;
	//ИначеЕсли Стоймость > 5000 Тогда
	//	Скидка = 0.02 * Стоймость;
	//КонецЕсли;
	//
	//СтоймостьСоСкидкой = Стоймость - Скидка;
	//
	//Массив = Новый Массив;
	//
	//Массив.Добавить(Стоймость);          //Массив[0]
	//Массив.Добавить(Скидка);             //Массив[1]
	//Массив.Добавить(СтоймостьСоСкидкой); //Массив[2]
	//
	//Возврат Массив;	

КонецФункции