
Процедура ПередНачаломРаботыСистемы(Отказ)
	
//Отказ = Истина;

//НовыйОбъект = Справочники.Склады.СоздатьЭлемент();

КонецПроцедуры


Процедура ПриНачалеРаботыСистемы()
	
	Время = Час(ТекущаяДата());
	
	Если (Время>=6) и (Время<=11) Тогда
		Сообщить("Доброе утро!");
	ИначеЕсли (Время>=12) и (Время<=17) Тогда
		Сообщить("Добрый день");
	ИначеЕсли (Время>=18) и (Время<=23) Тогда
		Сообщить("Добрый вечер");
	Иначе
		Сообщить("Доброго времени суток");
	КонецЕсли	
	
КонецПроцедуры


Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	 Отказ = Истина;
	 ТекстПредупреждения = "Завершить работу с системой?";
	
КонецПроцедуры


Процедура ПриЗавершенииРаботыСистемы()
	// Вставить содержимое обработчика.
КонецПроцедуры

