//Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
//	
//	ПараметрыСеанса.ОсновнаяВалюта = Справочники.Валюты.Рубль;
//	
//	
//	//Сопоставлене текущего пользователя с пользователем в системе.
//	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя());
//	
//	Если ФизЛицо.Пустая() Тогда 
//		//Если пользователь не найден то создаем	
//		НовоеФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
//		НовоеФизЛицо.Наименование = ИмяПользователя();
//		НовоеФизЛицо.Записать();
//		ФизЛицо = НовоеФизЛицо.Ссылка;	
//	КонецЕсли;	
//	ПараметрыСеанса.ТекушийПользователь = ФизЛицо;     
//
//  КонецПроцедуры

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)	
	
   	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
   	ПараметрыСеанса.ТекушийПользователь = Справочники.Пользователи.ПолучитьПользователя(Пользователь);

КонецПроцедуры
