
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	 СтрокаТабличнойЧасти.ЦенаПоступления = ЦенаИзНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	 СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	 
КонецПроцедуры

&НаСервере
Функция ЦенаИзНоменклатурыНаСервере(Номенклатура)
	
	Возврат Номенклатура.ЦенаЗакупки;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличетствоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	//Очищаем табличную часть
	Объект.Товары.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)

 Объект.Товары.Очистить();

КонецПроцедуры
