
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЦенаПоступления = ЦенаИзНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаСервере
Функция ЦенаИзНоменклатурыНаСервере(Номенклатура)
	
	 Возврат Номенклатура.ЦенаЗакупки;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
//Выбор всех товаров
	
	Для каждого ТекСтрокаТовары Из Объект.Товары Цикл	   
		ТекСтрокаТовары.КОформлению = Истина;
	КонецЦикла;  	
						
КонецПроцедуры



