
&НаСервере
Процедура СоздатьДокументНаСервере()
	
	Если Не ЗначениеЗаполнено(ВыборСклада) Тогда
		Сообщить("Склад не выбран!");
		Возврат;
	КонецЕсли;
	
	НовыйДок = Документы.РеализацияТоваровИУслуг.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Склады = ВыборСклада;
	
	МассивВидовНоменклатуры = Новый Массив;
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Товар);
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.ОсобыйТовар);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаРеализации,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ТоварыНаСкладахОстатки.КоличествоОстаток КАК Стоймость
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", МассивВидовНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Склад", ВыборСклада);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НовыйДок.Товары.Загрузить(РезультатЗапроса);
	
	НовыйДок.Записать(?(ЭтаФорма.Проведение, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	
	Сообщить("Выполнено!");	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры
