
Процедура ЗагрузкиИзИсточниковСервер(ПутьКФайлу) Экспорт
	
	//Получить текстовый документ
	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(ПутьКФайлу);
	
	//Построчный обход текстового документа
	Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		
		//Получить строку документа
		СтрокаДокумента = Документ.ПолучитьСтроку(НомерСтроки);
		
		//Разложим каждое значение, разделенное ; в массив
		МассивЗначенийСтроки = СтрРазделить(СтрокаДокумента, ";");
		
		//Получить значение массива
		НаименованиеКонтрагента    = МассивЗначенийСтроки[0];
		НаименованиеРодителя       = МассивЗначенийСтроки[1];
		НаименованиеИНН            = МассивЗначенийСтроки[2];
		НаименованиеВидКонтрагента = МассивЗначенийСтроки[3];
		
		//Проверка на создание повторного элемента в Общие модули>СоздатьСправочник>Функция "ПроверкаЭлемента"  
		
		//Создать элемент
		НовыйЭлементКонтрагенты = Справочники.Контрагенты.СоздатьЭлемент();	
		НовыйЭлементКонтрагенты.Наименование = НаименованиеКонтрагента;
		НовыйЭлементКонтрагенты.ИНН          = НаименованиеИНН;
		
		Если НаименованиеВидКонтрагента = "Юридическое лицо" Тогда
			
			НовыйЭлементКонтрагенты.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
			
		ИначеЕсли НаименованиеВидКонтрагента = "Физическое лицо" Тогда
			
			НовыйЭлементКонтрагенты.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
			
		КонецЕсли;
		
		//Ищем группу в файле
		Если НЕ ПустаяСтрока(НаименованиеРодителя) Тогда
			
			//Ищем группу по названию и присваиваем родителя
			НовыйЭлементКонтрагенты.Родитель = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеРодителя, Истина);
			
			//Если отсутвует, создаем
			Если НовыйЭлементКонтрагенты.Родитель.Пустая() Тогда
				НовыйЭлементГруппа               = Справочники.Контрагенты.СоздатьГруппу();
				НовыйЭлементГруппа.Наименование  = НаименованиеРодителя;
				НовыйЭлементГруппа.Записать();
				НовыйЭлементКонтрагенты.Родитель = НовыйЭлементГруппа.Ссылка;	
			КонецЕсли;	
			
		КонецЕсли;
		
		НовыйЭлементКонтрагенты.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


