
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектДляАнализа = Объект;
	
	//Рассчет наценки на форме
	Наценка = Объект.ЦенаРеализации - Объект.ЦенаЗакупки;
	
///////////////////////////////////////////////////////////////////////////////////	
	Штрихкоды.Параметры.УстановитьЗначениеПараметра("Номенклатура", Объект.Ссылка);
	
	//ЭтотОбъект - в модуле объекта
	//Объект - в формах элемента
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбъектДляАнализа = Объект
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбъектДляАнализа = Объект
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбъектДляАнализа = Объект
	
КонецПроцедуры


